In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('House_Price_2.csv')
df.head()

   Area_in_m2  Price_in_L  Bedrooms
0         656        39.0         2
1        1260        83.2         2
2        1057        86.6         3
3        1259        59.0         2
4        1800       140.0         3

In [3]:
colors = ['Black', 'Blue', 'Yellow', 'Pink']
import random

def color(row):
    return colors[random.randint(0,3)]

df['color'] = df.apply(lambda row: color(row), axis=1)

df.head()

   Area_in_m2  Price_in_L  Bedrooms   color
0         656        39.0         2    Blue
1        1260        83.2         2    Blue
2        1057        86.6         3   Black
3        1259        59.0         2    Blue
4        1800       140.0         3  Yellow

In [4]:
df.color.unique()

array(['Blue', 'Black', 'Yellow', 'Pink'], dtype=object)

In [5]:
df_encoded = pd.get_dummies(df, columns=['color'], drop_first=True)
df_encoded.head()

   Area_in_m2  Price_in_L  Bedrooms  color_Blue  color_Pink  color_Yellow
0         656        39.0         2        True       False         False
1        1260        83.2         2        True       False         False
2        1057        86.6         3       False       False         False
3        1259        59.0         2        True       False         False
4        1800       140.0         3       False       False          True

In [6]:
cm = df_encoded.corr()
cm

,Area_in_m2,Price_in_L,Bedrooms,color_Blue,color_Pink,color_Yellow
Area_in_m2,1.000000,0.694035,0.574889,-0.391072,0.259973,0.216098
Price_in_L,0.694035,1.000000,0.796603,-0.506955,0.047435,0.527776
Bedrooms,0.574889,0.796603,1.000000,-0.720082,0.238095,0.394771
color_Blue,-0.391072,-0.506955,-0.720082,1.000000,-0.617213,-0.284268
color_Pink,0.259973,0.047435,0.238095,-0.617213,1.000000,-0.394771
color_Yellow,0.216098,0.527776,0.394771,-0.284268,-0.394771,1.000000

In [7]:
cm['Price_in_L']

Area_in_m2      0.694035
Price_in_L      1.000000
Bedrooms        0.796603
color_Blue     -0.506955
color_Pink      0.047435
color_Yellow    0.527776
Name: Price_in_L, dtype: float64

In [8]:
cm_price = abs(cm['Price_in_L'])
cm_price

Area_in_m2      0.694035
Price_in_L      1.000000
Bedrooms        0.796603
color_Blue      0.506955
color_Pink      0.047435
color_Yellow    0.527776
Name: Price_in_L, dtype: float64

In [22]:
selected_features = cm_price[cm_price > 0.6].index.drop('Price_in_L')
selected_features

Index(['Area_in_m2', 'Bedrooms'], dtype='object')

In [24]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score, mean_squared_error

X = df_encoded[selected_features]
y = df['Price_in_L']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

model = LinearRegression()
model.fit(X_train, y_train)
y_pred = model.predict(X_test)
r2 = r2_score(y_test, y_pred)
mse = mean_squared_error(y_test, y_pred)

print("R2", r2, "MSE", mse)

R2 0.9265127037832256 MSE 48.88283085219565

In [26]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score, mean_squared_error

X = df_encoded.drop('Price_in_L', axis=1)
y = df['Price_in_L']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

model = LinearRegression()
model.fit(X_train, y_train)
y_pred = model.predict(X_test)
r2 = r2_score(y_test, y_pred)
mse = mean_squared_error(y_test, y_pred)

print("R2", r2, "MSE", mse)

R2 -2.5086328458061242 MSE 2333.898711119661

In [29]:
y_test, X_test

(11     49.0
 9      89.0
 0      39.0
 8     100.0
 Name: Price_in_L, dtype: float64,
     Area_in_m2  Bedrooms  color_Blue  color_Pink  color_Yellow
 11         700         2        True       False         False
 9          960         3       False       False          True
 0          656         2        True       False         False
 8         1700         3       False        True         False)

In [28]:
y_pred

array([ 86.25640963, 162.75493135,  87.44833461,  87.33020282])